tap 'homebrew/dupes'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

brew 'coreutils'
brew 'bash'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'git'
brew 'tree'
brew 'heroku-toolbelt'
brew 'vim', args: ['override-system-vi']
brew 'fzf'
brew 'ansible'
brew 'heroku-toolbelt'
brew 'glide'
brew 'postgres'
brew 'docker'
brew 'docker-compose'
brew 'dlite'
brew 'codeclimate'
brew 'nginx'
brew 'stow'
brew 'wget'
brew 'zsh'
brew 'pow'
brew 'redis'
brew 'memcached'
brew 'the_silver_searcher'
brew 'hub'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'ctags'
brew 'htop'

# Programming languages
brew 'lua'
brew 'luajit'
brew 'go'
brew 'node'

brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-gem-rehash'

brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'pyenv-virtualenvwrapper'

brew 'carthage'

brew 'elixir'
brew 'elm'
brew 'curl'
brew 'exercism'

# tools
brew 'switchaudio-osx'
brew 'axel'
brew 'lesspipe'
brew 'unison'
brew 'unrar'
brew 'xz'
brew 'ssh-copy-id'
brew 'youtube-dl'
brew 'zeromq'


brew 'brew-cask'
cask_args appdir: '/Applications'

# General
cask 'dropbox'
cask 'google-chrome'
cask 'spotify'
cask '1password'
cask 'skype'

# UI
cask 'flux'
# Utilities
cask 'transmission'
cask 'paw'
cask 'little-snitch'
cask 'recordit'
cask 'teamviewer'

# Development
cask 'iterm2'
cask 'sublime-text3'
cask 'vagrant'
cask 'virtualbox'
cask 'gitup'
cask 'font-hack'
cask 'postgres'
cask 'postico'
cask 'mactex'
